# To sort a section (keep capitalized header first): :sort /^\s*\(#\s*\)\?/

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'isen-ng/dotnet-sdk-versions'
tap 'mongodb/brew'
tap 'srkomodo/tap'
tap 'trinitronx/homebrew-pcloud'
tap 'ytsutano/toolbox'

# Binaries
brew 'act'
brew 'awscli'
brew 'axmldec'
brew 'bash'
brew 'bash-completion@2'
brew 'coreutils'
brew 'dockutil'
brew 'duti'
brew 'findutils'
brew 'gawk'
brew 'gh'
brew 'git'
brew 'gnu-sed'
brew 'grep'
brew 'imagemagick'
brew 'mackup'
brew 'mariadb'
brew 'mas'
brew 'mongodb-community'
brew 'nmap'
brew 'node'
brew 'openjdk@11' # Version 11 required for Android Gradle in Godot AAB Export
brew 'pianobar'
brew 'pyenv'
brew 'pyenv-virtualenvwrapper'
brew 'scons'
brew 'screen'
brew 'shadowfox-updater'
brew 'transmission'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'yasm'

# Apps
cask '1password'
cask '1password-cli'
cask 'adobe-acrobat-reader'
cask 'android-ndk'
cask 'android-sdk'
cask 'android-studio'
cask 'anki'
cask 'audacity'
cask 'cleanmymac'
cask 'discord'
cask 'dotnet-sdk6-0-400' # latest dotnet 6 for Godot Mono 3 C# projects
cask 'dotnet-sdk7-0-200' # latest dotnet 7 for non-Godot C# projects
cask 'dotnet-sdk8-0-300' # latest dotnet 8 for Godot Mono 4 C# projects
cask 'firefox'
cask 'gpg-suite-no-mail'
cask 'istat-menus'
cask 'itch'
cask 'iterm2'
cask 'macvim'
cask 'nordvpn'
cask 'notion'
cask 'notunes'
cask 'pcloud-drive'
cask 'rider'
cask 'signal'
cask 'steam'
cask 'steelseries-engine'
cask 'sync'
cask 'tetrio'
cask 'texturepacker'
cask 'the-unarchiver'
cask 'turbo-boost-switcher'
cask 'visual-studio-code'
cask 'vmware-fusion'
cask 'zoom'

# Mac App Store
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
