# To sort a section (keep capitalized header first): :sort /^\s*\(#\s*\)\?/

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'trinitronx/homebrew-pcloud'

# Binaries
brew 'act'
brew 'awscli'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
# brew 'dockutil' # Not working on macOS >= 12.3, see https://github.com/kcrawford/dockutil/issues/127
brew 'duti'
brew 'findutils'
brew 'gawk'
brew 'gh'
brew 'git'
brew 'gnu-sed'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'nmap'
brew 'node'
brew 'pianobar'
brew 'pyenv'
brew 'pyenv-virtualenvwrapper'
brew 'scons'
brew 'screen'
brew 'transmission'
brew 'tree'
brew 'yasm'

# Apps
cask '1password'
cask '1password-cli'
cask 'adobe-acrobat-reader'
cask 'airfoil'
cask 'authy'
cask 'cleanmymac'
cask 'discord'
cask 'dotnet-sdk'
cask 'expressvpn'
cask 'flux'
cask 'godot-mono'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
# Workaround for 'dockutil' on macOS >= 12.3, See https://github.com/kcrawford/dockutil/issues/127
cask 'hpedrorodrigues/tools/dockutil'
cask 'istat-menus'
cask 'itch'
cask 'iterm2'
cask 'lmms'
cask 'loopback'
cask 'macvim'
cask 'obs'
cask 'parallels'
cask 'pcloud-drive'
cask 'pycharm-ce'
cask 'rider'
cask 'securityspy'
cask 'signal'
cask 'slack'
cask 'steam'
cask 'steelseries-engine'
cask 'sync'
cask 'tetrio'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vmware-fusion'
cask 'zoom'

# Mac App Store
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
