# To sort a section (keep capitalized header first): :sort /^\s*\(#\s*\)\?/

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'

# Binaries
brew 'act'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'dockutil'
brew 'duti'
brew 'gawk'
brew 'gcc'
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pyenv'

# Apps
cask '1password'
cask '1password-cli'
cask 'airfoil'
cask 'cleanmymac'
cask 'discord'
cask 'dropbox'
cask 'flux'
cask 'godot-mono'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'istat-menus'
cask 'itch'
cask 'iterm2'
cask 'loopback'
cask 'macvim'
cask 'parallels'
cask 'rider'
cask 'signal'
cask 'slack'
cask 'steam'
cask 'steelseries-engine'
cask 'sync'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vmware-fusion'
cask 'zoom'

# Mac App Store
mas "GarageBand", id: 682658836
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Speedtest by Ookla", id: 1153157709
mas "Xcode", id: 497799835
mas "iMovie", id: 408981434
